Public Attributes | List of all members
API_3DFilterAndCutSettings Struct Reference
View Handling
Parameters of the 'Filter and Cut Elements in 3D' dialog. More...
#include <APIdefs_Environment.h>
 Public Attributes
 short  | firstStory3D
First story to convert. Valid only if allStories is false.
 short  | lastStory3D
Last story to convert. Valid only if allStories is false.
 bool  | allStories
Create a 3D projection of all stories rather than a range of stories defined by firstStory3D.. lastStory3D.
 API_MarqueeFilter  | marqueeFilter
Image only the elements that are within or outside the marquee area defined in the floor plan.
 bool  | trimToStoryRange
Trims elements to the story range (see the Trim Elements to story range checkbox in the "Filter and Cut Elements in 3D" dialog.
 API_3DFilterModeID  | filterMode
The 3D filter mode. For available modes see API_3DFilterModeID enumeration. (output only)
 std::map< API_ElemTypeID, bool >  | elemTypeFilter
A map containig API_ElemTypeID pairs. ACAPI_View_Change3DImageSets function will set element types with false value invisible on 3D and element types with true value visible. API_ZombieElemID will change the visibility of all element types regardless of other passed element types.
Detailed Description
Parameters of the 'Filter and Cut Elements in 3D' dialog.
Since
Archicad 26
Remarks
This structure is used to retrieve and modify the data of the 3D image item settings by the ACAPI_View_Get3DImageSets and ACAPI_View_Change3DImageSets environment functions. Note that the visibility of GDL-based elements can also be modified through GDL parmeters which can overwrite the visibility settings in API_3DFilterAndCutSettings.